app/controllers/communities_controller.rb

  def index
    @communities = Community.all
---
SELECT "communities".* FROM "communities"

  def create
    @community = Community.new(community_params)

    respond_to do |format|
      if @community.save
---
INSERT INTO "communities" ("created_at", "me", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-16 01:23:08.367702"], ["me", "MyString"], ["updated_at", "2014-10-16 01:23:08.367702"]]

  def destroy
    @community.destroy
---
DELETE FROM "communities" WHERE "communities"."id" = ?  [["id", 980190962]]

    def set_community
      @community = Community.find(params[:id])
---
SELECT  "communities".* FROM "communities"  WHERE "communities"."id" = ? LIMIT 1  [["id", 980190962]]