app/controllers/parties_controller.rb

SELECT "parties".* FROM "parties"
---
  def index
    @parties = Party.order(:time)
    @parties = @parties.paginate(:page => params[:page], :per_page => 20)

SELECT "parties".* FROM "parties"   ORDER BY "parties"."time" DESC
SELECT "parties".* FROM "parties"
---
  def upcoming
    current = DateTime.now
    @parties = Party.where("time >= ?", current)
    @parties = @parties.order(:time)
    @parties = @parties.paginate(:page => params[:page], :per_page => 20)

SELECT "parties".* FROM "parties"
---
  def past
    current = DateTime.now
    @parties = Party.where("time < ?", current)
    @parties = @parties.order(:time)
    @parties = @parties.paginate(:page => params[:page], :per_page => 20)

INSERT INTO "parties" ("created_at", "description", "location", "name", "owner", "participants", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @party = Party.new(party_params)
    @party.time = DateTime.new(@party.date.year, @party.date.month, @party.date.day, @party.time.hour, @party.time.min, @party.time.sec, @party.date.zone)
    owner = User.find(current_user.id)
    @join_member = @party.join_members.build(user: owner)
    @join_member.status = 4
    @join_member.save

UPDATE "parties" SET "description" = ?, "location" = ?, "name" = ?, "owner" = ?, "participants" = ?, "time" = ?, "updated_at" = ? WHERE "parties"."id" = 980190962
---
  def update
    respond_to do |format|
      if @party.update(party_params)

DELETE FROM "parties" WHERE "parties"."id" = ?  [["id", 980190962]]
---
  def destroy
    @party.destroy

SELECT  "parties".* FROM "parties"  WHERE "parties"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_party
      @party = Party.find(params[:id])